NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm33/iar/startup_MIMXRT118x_cm33.s
        PUBWEAK USDHC2_IRQHandler
        PUBWEAK USDHC2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC2_IRQHandler
        LDR     R0, =USDHC2_DriverIRQHandler
        BX      R0

        PUBWEAK TRDC_MGR_MEGA_IRQHandler
        PUBWEAK SFA_IRQHandler
        PUBWEAK LDO_AON_DIG_IRQHandler
        PUBWEAK MECC1_IRQHandler
        PUBWEAK MECC2_IRQHandler
        PUBWEAK ADC1_IRQHandler
        PUBWEAK DMA_ERROR_IRQHandler
        PUBWEAK DMA_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_ERROR_IRQHandler
        LDR     R0, =DMA_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH0_IRQHandler
        PUBWEAK DMA3_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH0_IRQHandler
        LDR     R0, =DMA3_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH1_IRQHandler
        PUBWEAK DMA3_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH1_IRQHandler
        LDR     R0, =DMA3_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH2_IRQHandler
        PUBWEAK DMA3_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH2_IRQHandler
        LDR     R0, =DMA3_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH3_IRQHandler
        PUBWEAK DMA3_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH3_IRQHandler
        LDR     R0, =DMA3_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH4_IRQHandler
        PUBWEAK DMA3_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH4_IRQHandler
        LDR     R0, =DMA3_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH5_IRQHandler
        PUBWEAK DMA3_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH5_IRQHandler
        LDR     R0, =DMA3_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH6_IRQHandler
        PUBWEAK DMA3_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH6_IRQHandler
        LDR     R0, =DMA3_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH7_IRQHandler
        PUBWEAK DMA3_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH7_IRQHandler
        LDR     R0, =DMA3_CH7_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH8_IRQHandler
        PUBWEAK DMA3_CH8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH8_IRQHandler
        LDR     R0, =DMA3_CH8_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH9_IRQHandler
        PUBWEAK DMA3_CH9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH9_IRQHandler
        LDR     R0, =DMA3_CH9_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH10_IRQHandler
        PUBWEAK DMA3_CH10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH10_IRQHandler
        LDR     R0, =DMA3_CH10_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH11_IRQHandler
        PUBWEAK DMA3_CH11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH11_IRQHandler
        LDR     R0, =DMA3_CH11_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH12_IRQHandler
        PUBWEAK DMA3_CH12_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH12_IRQHandler
        LDR     R0, =DMA3_CH12_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH13_IRQHandler
        PUBWEAK DMA3_CH13_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH13_IRQHandler
        LDR     R0, =DMA3_CH13_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH14_IRQHandler
        PUBWEAK DMA3_CH14_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH14_IRQHandler
        LDR     R0, =DMA3_CH14_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH15_IRQHandler
        PUBWEAK DMA3_CH15_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH15_IRQHandler
        LDR     R0, =DMA3_CH15_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH16_IRQHandler
        PUBWEAK DMA3_CH16_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH16_IRQHandler
        LDR     R0, =DMA3_CH16_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH17_IRQHandler
        PUBWEAK DMA3_CH17_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH17_IRQHandler
        LDR     R0, =DMA3_CH17_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH18_IRQHandler
        PUBWEAK DMA3_CH18_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH18_IRQHandler
        LDR     R0, =DMA3_CH18_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH19_IRQHandler
        PUBWEAK DMA3_CH19_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH19_IRQHandler
        LDR     R0, =DMA3_CH19_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH20_IRQHandler
        PUBWEAK DMA3_CH20_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH20_IRQHandler
        LDR     R0, =DMA3_CH20_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH21_IRQHandler
        PUBWEAK DMA3_CH21_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH21_IRQHandler
        LDR     R0, =DMA3_CH21_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH22_IRQHandler
        PUBWEAK DMA3_CH22_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH22_IRQHandler
        LDR     R0, =DMA3_CH22_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH23_IRQHandler
        PUBWEAK DMA3_CH23_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH23_IRQHandler
        LDR     R0, =DMA3_CH23_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH24_IRQHandler
        PUBWEAK DMA3_CH24_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH24_IRQHandler
        LDR     R0, =DMA3_CH24_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH25_IRQHandler
        PUBWEAK DMA3_CH25_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH25_IRQHandler
        LDR     R0, =DMA3_CH25_DriverIRQHandler
        BX      R0

