NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm33/iar/startup_MIMXRT118x_cm33.s
        PUBWEAK DMA3_CH26_IRQHandler
        PUBWEAK DMA3_CH26_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH26_IRQHandler
        LDR     R0, =DMA3_CH26_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH27_IRQHandler
        PUBWEAK DMA3_CH27_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH27_IRQHandler
        LDR     R0, =DMA3_CH27_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH28_IRQHandler
        PUBWEAK DMA3_CH28_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH28_IRQHandler
        LDR     R0, =DMA3_CH28_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH29_IRQHandler
        PUBWEAK DMA3_CH29_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH29_IRQHandler
        LDR     R0, =DMA3_CH29_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH30_IRQHandler
        PUBWEAK DMA3_CH30_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH30_IRQHandler
        LDR     R0, =DMA3_CH30_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH31_IRQHandler
        PUBWEAK DMA3_CH31_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH31_IRQHandler
        LDR     R0, =DMA3_CH31_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_ERROR_IRQHandler
        PUBWEAK DMA4_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_ERROR_IRQHandler
        LDR     R0, =DMA4_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH0_CH1_CH32_CH33_IRQHandler
        PUBWEAK DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH0_CH1_CH32_CH33_IRQHandler
        LDR     R0, =DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH2_CH3_CH34_CH35_IRQHandler
        PUBWEAK DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH2_CH3_CH34_CH35_IRQHandler
        LDR     R0, =DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH4_CH5_CH36_CH37_IRQHandler
        PUBWEAK DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH4_CH5_CH36_CH37_IRQHandler
        LDR     R0, =DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH6_CH7_CH38_CH39_IRQHandler
        PUBWEAK DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH6_CH7_CH38_CH39_IRQHandler
        LDR     R0, =DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH8_CH9_CH40_CH41_IRQHandler
        PUBWEAK DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH8_CH9_CH40_CH41_IRQHandler
        LDR     R0, =DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH10_CH11_CH42_CH43_IRQHandler
        PUBWEAK DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH10_CH11_CH42_CH43_IRQHandler
        LDR     R0, =DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH12_CH13_CH44_CH45_IRQHandler
        PUBWEAK DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH12_CH13_CH44_CH45_IRQHandler
        LDR     R0, =DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH14_CH15_CH46_CH47_IRQHandler
        PUBWEAK DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH14_CH15_CH46_CH47_IRQHandler
        LDR     R0, =DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH16_CH17_CH48_CH49_IRQHandler
        PUBWEAK DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH16_CH17_CH48_CH49_IRQHandler
        LDR     R0, =DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH18_CH19_CH50_CH51_IRQHandler
        PUBWEAK DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH18_CH19_CH50_CH51_IRQHandler
        LDR     R0, =DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH20_CH21_CH52_CH53_IRQHandler
        PUBWEAK DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH20_CH21_CH52_CH53_IRQHandler
        LDR     R0, =DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH22_CH23_CH54_CH55_IRQHandler
        PUBWEAK DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH22_CH23_CH54_CH55_IRQHandler
        LDR     R0, =DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH24_CH25_CH56_CH57_IRQHandler
        PUBWEAK DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH24_CH25_CH56_CH57_IRQHandler
        LDR     R0, =DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH26_CH27_CH58_CH59_IRQHandler
        PUBWEAK DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH26_CH27_CH58_CH59_IRQHandler
        LDR     R0, =DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH28_CH29_CH60_CH61_IRQHandler
        PUBWEAK DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH28_CH29_CH60_CH61_IRQHandler
        LDR     R0, =DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH30_CH31_CH62_CH63_IRQHandler
        PUBWEAK DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH30_CH31_CH62_CH63_IRQHandler
        LDR     R0, =DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
        BX      R0

        PUBWEAK XBAR1_CH0_CH1_IRQHandler
        PUBWEAK XBAR1_CH2_CH3_IRQHandler
        PUBWEAK SINC3_CH0_CH1_CH2_CH3_IRQHandler
        PUBWEAK EWM_IRQHandler
        PUBWEAK SEMC_IRQHandler
        PUBWEAK LPIT3_IRQHandler
        PUBWEAK LPTMR3_IRQHandler
        PUBWEAK TMR4_IRQHandler
        PUBWEAK LPI2C5_IRQHandler
        PUBWEAK LPI2C5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C5_IRQHandler
        LDR     R0, =LPI2C5_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C6_IRQHandler
        PUBWEAK LPI2C6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C6_IRQHandler
        LDR     R0, =LPI2C6_DriverIRQHandler
        BX      R0

        PUBWEAK SAI4_IRQHandler
        PUBWEAK SAI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI4_IRQHandler
        LDR     R0, =SAI4_DriverIRQHandler
        BX      R0

        PUBWEAK SPDIF_IRQHandler
        PUBWEAK SPDIF_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SPDIF_IRQHandler
        LDR     R0, =SPDIF_DriverIRQHandler
        BX      R0

